AccumulationRegisters/ИнгредиентыВНаличии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ИнгредиентыВНаличии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Продажа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПродуктов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Продукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Продукты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МинимальныйОстаток/Ext/Module.bsl
Процедура ЗаполнитьТаблицуМинимальногоОстатка(ТабЗнач) Экспорт

	ТабЗнач.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукты.МинимальноеКоличество КАК МинимальноеКоличество,
		|	Продукты.Ссылка КАК Продукт,
		|	Продукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВтПродукты
		|ИЗ
		|	Справочник.Продукты КАК Продукты
		|ГДЕ
		|	Продукты.ПометкаУдаления = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Продукт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнгредиентыВНаличииОстатки.Номенклатура КАК Номенклатура,
		|	ИнгредиентыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ
		|	РегистрНакопления.ИнгредиентыВНаличии.Остатки(
		|			,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ВтПродукты.Продукт КАК Продукт
		|				ИЗ
		|					ВтПродукты КАК ВтПродукты)) КАК ИнгредиентыВНаличииОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПродуктовОстатки.Продукт КАК Продукт,
		|	ЕСТЬNULL(ЗаказыПродуктовОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВтЗакупки
		|ИЗ
		|	РегистрНакопления.ЗаказыПродуктов.Остатки(
		|			,
		|			Продукт В
		|				(ВЫБРАТЬ
		|					ВтПродукты.Продукт КАК Продукт
		|				ИЗ
		|					ВтПродукты КАК ВтПродукты)) КАК ЗаказыПродуктовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтПродукты.Продукт КАК Продукт,
		|	ВтПродукты.МинимальноеКоличество КАК МинимальноеКоличество,
		|	ЕСТЬNULL(ВтОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВтЗакупки.КоличествоОстаток, 0) КАК Заказано,
		|	ВтПродукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВтПродукты КАК ВтПродукты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
		|		ПО ВтПродукты.Продукт = ВтОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗакупки КАК ВтЗакупки
		|		ПО ВтПродукты.Продукт = ВтЗакупки.Продукт
		|ГДЕ
		|	ВтПродукты.МинимальноеКоличество > ЕСТЬNULL(ВтОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВтЗакупки.КоличествоОстаток, 0)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТаблицы = ТабЗнач.Добавить();
		СтрокаТаблицы.Продукт = ВыборкаДетальныеЗаписи.Продукт;
		СтрокаТаблицы.МинимальноеКоличество = ВыборкаДетальныеЗаписи.МинимальноеКоличество;
		СтрокаТаблицы.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТаблицы.Заказано = ВыборкаДетальныеЗаписи.Заказано;
		СтрокаТаблицы.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
		
	КонецЦикла;
	

	
КонецПроцедуры
